Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview of mortgage debt
ga: Forbhreathnú ar fhiachas morgáiste

source: Information for people facing mortgage arrears
ga: Eolas do dhaoine atá i mbaol fiachais mhorgáiste

source: Consumer protection codes and mortgages
ga: Cóid um chosaint tomhaltóirí agus morgáistí

source: Mortgage lenders must adhere to codes of conduct when dealing with customers. Find out more
ga: Ní mór d'iasachtóirí morgáiste cloí le cóid reachtúla

source: Mortgage Arrears Resolution Process (MARP)
ga: Próiseas Réitigh do Riaráistí Morgáiste (MARP)

source: Mortgage lenders must follow a defined process when dealing with borrowers facing arrears. This process is known as MARP
ga: Ní mór d'iasachtóirí morgáiste próiseas sainmhínithe a leanúint agus iad ag plé le riaráistí morgáiste

source: Responses to mortgage arrears and personal debt
ga: Freagairtí maidir le riaráistí morgáiste agus fiachas pearsanta

source: Developments and proposals in the area of mortgage arrears and personal debt
ga: Forbairtí agus tograí i limistéar na riaráistí morgáiste agus fiachais phearsanta

source: Abhaile - free mortgage arrears support
ga: An scéim náisiúnta um morgáiste-chuig-cíos

source: A new scheme offers financial, legal and insolvency advice to borrowers who are in serious mortgage arrears
ga: Déantar cur síos ar an scéim um morgáiste-chuig-cíos, a ligeann do dhaoine a bhfuil deacrachtaí morgáiste acu aistriú chuig a dtithe a ligean ar cíos

source: Alternative repayment arrangements for people in mortgage difficulty
ga: Riaráistí morgáiste: scéim cúnaimh agus comhairle

source: Information on alternative repayment arrangements and other options for people faced with mortgage arrears. Issues to consider when assessing your options
ga: Cuireann scéim nua comhairle airgeadais, dlí agus dócmhainneachta ar fáil d’iasachtaithe a bhfuil riaráistí tromchúiseacha morgáiste acu

source: Describes the mortgage-to-rent scheme, which allows people in mortgage difficulty to switch to renting their homes
ga: Saincheisteanna a bhfuil machnamh le déanamh orthu nuair a bhíonn do chuid roghanna á measúnú agat

source: Most Read in "Housing"
ga: Ábhar is mó éilimh i "Tithíocht"

source: Applying for local authority/social housing
ga: Iarratas a dhéanamh ar thithíocht shóisialta/údaráis áitiúil

source: If your landlord wants you to leave
ga: Má theastaíonn ó do thiarna talún go bhfágfadh tú an teach nó an t-árasan
